[{
    "title": "Vue Pokédex",
    "description": "A pokedex made with Vue, TypeScript, Tailwind, and Pinia. This was made to help my kids with their various pokemon questions as they played through the recent releases. The intent was to make all the info from the core RPG games easily accessible in a single page",
    "image": "/images/pokedex-vue-image.png",
    "links": {
        "github": "https://github.com/erikgoranson/pokedex-vue",
        "live": "https://erikgoranson-pokedex-vue.vercel.app/"
    }
}, {
    "title": "Firefly Chinese Web Scraper",
    "description": "A Python app for scraping translations of the Chinese phrases which appeared in Firefly and Serenity from an old fansite. The intent was to use this data to seed an API for the Chinese that appears on the show",
    "image": "https://github.com/erikgoranson/firefly-chinese-web-scraper/raw/main/screenshot.png",
    "links": {
        "github": "https://github.com/erikgoranson/firefly-chinese-web-scraper"
    }
}, {
    "title": "Portfolio",
    "description": "You are here. My portfolio website built with VueJs, Typescript, and Tailwind. Also my first foray into designing a logo for a site.",
    "image": "/images/portfolio-image.png",
    "links": {
        "github": "https://github.com/erikgoranson/portfolio",
        "live": "https://erikgoranson-portfolio.vercel.app/"
    }
}, {
    "title": "Prize Game",
    "description": "This is a C# console app based on an interview question I received. The test was to write an algorithm for the user's player that allowed them to collect the highest score of any of the four players. This project was an attempt to rebuild the console application used in that test from memory",
    "image": "https://user-images.githubusercontent.com/54157038/205478600-09fc26b0-a816-40db-9a7e-8b30c9913bac.PNG",
    "links": {
        "github": "https://github.com/erikgoranson/PrizeGame"
    }
}, {
    "title": "Firefly Translations API",
    "description": "An API built using Flask, SQLAlchemy, and Marshmallow to allow easy access to the Chinese (and English translations) that appear in the series Firefly. A work in progress for some close friends who share the appreciation for the added flavor these bits lent to the show",
    "image": "https://github.com/erikgoranson/firefly-chinese-web-scraper/raw/main/screenshot.png",
    "links": {
        "github": "https://github.com/erikgoranson/firefly-translation-api"
    }
}]